# 01 Data Set

In [10]:
import pandas as pd

In [11]:
data = pd.read_table('http://bit.ly/chiporders')
data.to_csv('../data/chiporders.csv')

In [12]:
data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [13]:
# data.head()
# data.tail()
data.shape

(4622, 5)

In [14]:
col_names = ['ID', 'Age', 'Gender', 'Occupation', 'Revenue']

In [22]:
# data2 = pd.read_table('http://bit.ly/movieusers')
# data2.to_csv('../data/movieusers.csv', index=None, sep=' ', mode='a')
data2 = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=col_names)

In [16]:
data2

          1|24|M|technician|85711
0              2|53|F|other|94043
1             3|23|M|writer|32067
2         4|24|M|technician|43537
3              5|33|F|other|15213
4          6|42|M|executive|98101
..                            ...
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

[942 rows x 1 columns]